#!/usr/bin/env python
# -*- coding:utf-8 -*-  
#====#====#====#====   
#Author:
#CreatDate:
#Version: 
#====#====#====#====
'''
1.简述自动化测试流程？
1、自动测试决定
2、测试工具获取
3、自动化测试引入
4、制定测试计划
5、测试执行与管理
6、测试审评和评估
2.简述自动化测试的优势和局限性？
	1.可重复
	2.可程序化
	3.可靠
	4.提高测试的精确度
	5.提升测试资源的的利用率
局限性：如果代码不对，就无法得出准确结果;如果被测试的程序界面修改了，代码也不能正常运行没有错误联想功能1.简述自动化测试流程？
1、自动测试决定
2、测试工具获取
3、自动化测试引入
4、制定测试计划
5、测试执行与管理
6、测试审评和评估
2.简述自动化测试的优势和局限性？
	1.可重复
	2.可程序化
	3.可靠
	4.提高测试的精确度
	5.提升测试资源的的利用率
局限性：如果代码不对，就无法得出准确结果;如果被测试的程序界面修改了，代码也不能正常运行没有错误联想功能

'''